VTP, Access and Trunk Port
--------------------------
*view the vlan database
SW1#sh vlan brief

*view the switchport status
SW1#sh int g0/1 switchport 

*configure the link between the switches as trunk
SW1(config)#int g0/1
SW1(config-if)#switchport mode trunk
SW2(config)#int g0/1
SW2(config-if)#switchport mode trunk
SW2(config-if)#int g0/2
SW2(config-if)#switchport mode trunk
SW3(config)#int g0/2
SW3(config-if)#switchport mode trunk

*configure SW1 as VTP server
SW1(config)#vtp domain Flackbox
Changing VTP domain name from NULL to Flackbox
SW1(config)#vtp mode server
Device mode already VTP SERVER.

*SW2 must not synchronise its VLAN database with SW1
SW2(config)#vtp mode transparent
Setting device to VTP TRANSPARENT mode.

*sw3 must learn vlan information from sw1. vlan should not be edited on sw3
SW3(config)#vtp mode client
Setting device to VTP CLIENT mode.
SW3(config)#vtp domain Flackbox
Changing VTP domain name from NULL to Flackbox


*add the vlan name on the switches
SW1(config)#vlan 10
SW1(config-vlan)#name Eng
SW1(config-vlan)#vlan 20
SW1(config-vlan)#name Sales
SW1(config-vlan)#vlan 199
SW1(config-vlan)#name Native
SW2(config)#vlan 10
SW2(config-vlan)#name Eng
SW2(config-vlan)#vlan 20
SW2(config-vlan)#name Sales
SW2(config-vlan)#vlan 199
SW2(config-vlan)#name Native

*configure the trunk link to use native vlan for better security
SW1(config)#int g0/1
SW1(config-if)#switchport trunk native vlan 199
SW2(config)#int g0/1
SW2(config-if)#switchport trunk native vlan 199
SW2(config-if)#int g0/2
SW2(config-if)#switchport trunk native vlan 199
SW3(config-if)#int g0/2
SW3(config-if)#switchport trunk native vlan 199

*configure the pc's as their correct vlan 
SW1(config)#int range f0/1-2
SW1(config-if-range)#switchport mode access
SW1(config-if-range)#switchport access vlan 10
SW1(config-if-range)#int f0/3
SW1(config-if)#switchport mode access
SW1(config-if)#switchport access vlan 20
SW3(config-if)#int range f0/1-2
SW3(config-if-range)#switchport mode access
SW3(config-if-range)#switchport access vlan 20
SW3(config-if-range)#int f0/3
SW3(config-if)#switchport mode access
SW3(config-if)#switchport access vlan 10

*eng1 has connectivity to eng3
C:\>ping 10.10.10.12
success

*sales1 has connectivity to sales3
C:\>ping 10.10.20.12
success
