VTP, Access and Trunk Port
--------------------------
*view the vlan database
SW1#sh vlan brief

*view the switchport status
SW1#sh int g0/1 switchport 

*configure the link between the switches as trunk
SW1(config)#int g0/1
SW1(config-if)#switchport mode trunk
SW2(config)#int g0/1
SW2(config-if)#switchport mode trunk
SW2(config-if)#int g0/2
SW2(config-if)#switchport mode trunk
SW3(config)#int g0/2
SW3(config-if)#switchport mode trunk

*configure SW1 as VTP server
SW1(config)#vtp domain Flackbox
Changing VTP domain name from NULL to Flackbox
SW1(config)#vtp mode server
Device mode already VTP SERVER.

*SW2 must not synchronise its VLAN database with SW1
SW2(config)#vtp mode transparent
Setting device to VTP TRANSPARENT mode.

*sw3 must learn vlan information from sw1. vlan should not be edited on sw3
SW3(config)#vtp mode client
Setting device to VTP CLIENT mode.
SW3(config)#vtp domain Flackbox
Changing VTP domain name from NULL to Flackbox


*add the vlan name on the switches
SW1(config)#vlan 10
SW1(config-vlan)#name Eng
SW1(config-vlan)#vlan 20
SW1(config-vlan)#name Sales
SW1(config-vlan)#vlan 199
SW1(config-vlan)#name Native
SW2(config)#vlan 10
SW2(config-vlan)#name Eng
SW2(config-vlan)#vlan 20
SW2(config-vlan)#name Sales
SW2(config-vlan)#vlan 199
SW2(config-vlan)#name Native

*configure the trunk link to use native vlan for better security
SW1(config)#int g0/1
SW1(config-if)#switchport trunk native vlan 199
SW2(config)#int g0/1
SW2(config-if)#switchport trunk native vlan 199
SW2(config-if)#int g0/2
SW2(config-if)#switchport trunk native vlan 199
SW3(config-if)#int g0/2
SW3(config-if)#switchport trunk native vlan 199

*configure the pc's as their correct vlan 
SW1(config)#int range f0/1-2
SW1(config-if-range)#switchport mode access
SW1(config-if-range)#switchport access vlan 10
SW1(config-if-range)#int f0/3
SW1(config-if)#switchport mode access
SW1(config-if)#switchport access vlan 20
SW3(config-if)#int range f0/1-2
SW3(config-if-range)#switchport mode access
SW3(config-if-range)#switchport access vlan 20
SW3(config-if-range)#int f0/3
SW3(config-if)#switchport mode access
SW3(config-if)#switchport access vlan 10

*eng1 has connectivity to eng3
C:\>ping 10.10.10.12
success

*sales1 has connectivity to sales3
C:\>ping 10.10.20.12
success

-----Separate Interfaces on Router-----
*configure r1 f0/0 as the default gateway for eng pc's
R1(config)#int f0/0
R1(config-if)#ip address 10.10.10.1 255.255.255.0
R1(config-if)#no shut

*configure r1 f0/1 as the default gateway for sales pc's
R1(config-if)#int f0/1
R1(config-if)#ip address 10.10.20.1 255.255.255.0
R1(config-if)#no shut

*configuring sw2 for support inter vlan routing
SW2(config)#int f0/1
SW2(config-if)#switchport mode access
SW2(config-if)#switchport access vlan 10
SW2(config-if)#int f0/2
SW2(config-if)#switchport mode access
SW2(config-if)#switchport access vlan 20

*verifing that eng pc has connectivity to sales pc
C:\>ping 10.10.20.10
success

-----Router on a Stick-----
*shutting down int f0/1 on r1
R1(config)#int f0/1
R1(config-if)#shutdown

*configure sub interface f0/0 on r1 
R1(config)#int f0/0
R1(config-if)#no ip address
R1(config-if)#no shut
R1(config-if)#int f0/0.10
R1(config-subif)#encapsulation dot1q 10
R1(config-subif)#ip address 10.10.10.1 255.255.255.0
R1(config-subif)#int f0/0.20
R1(config-subif)#encapsulation dot1q 20
R1(config-subif)#ip address 10.10.20.1 255.255.255.0

*configuring sw2 for support inter vlan routing
SW2(config)#int f0/1
SW2(config-if)#switchport trunk encapsulation dot1q
SW2(config-if)#switchport mode trunk

*sales1 has connectivity to sales3
C:\>ping 10.10.20.12
success

-----Layer 3 Switch-----
*shutting down int f0/0 on r1
R1(config)#int f0/0
R1(config-if)#shutdown

*enable layer 3 routing on sw2 
SW2(config)#ip routing

*configure svi(switch virtual interface) on sw2 to support inter vlan routing
SW2(config)#int vlan 10
SW2(config-if)#ip address 10.10.10.1 255.255.255.0
SW2(config-if)#int vlan 20
SW2(config-if)#ip address 10.10.20.1 255.255.255.0

*sales1 has connectivity to sales3
C:\>ping 10.10.20.12
success

-----[End]-----
